---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSize.OuterDiameter
source: html/e83f26b0-7906-3561-bc2b-4222ef12d927.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSize.OuterDiameter Property

Outer diameter

## Syntax (C#)
```csharp
public double OuterDiameter { get; }
```